backend/test/load/products.yml
config:
  target: "http://localhost:3000/api/v1"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
scenarios:
  - name: "Browse Products"
    flow:
      - get:
          url: "/products"
      - think: 2
      - get:
          url: "/products?category=SKINCARE"
      - think: 5
      - get:
          url: "/products?minPrice=10&maxPrice=100"